{"type":"data","nodes":[null,{"type":"data","data":[{"jobs":1,"volunteering":76},[2,26,37,48,54,60,68],{"company":3,"title":4,"currentPosition":5,"startDate":6,"endDate":7,"description":8,"location":9,"skills":10},"The New York Times","Staff Software Engineer • Games Team",true,"2021-02-16",null,"Lead architecture and implementation of tools and features for the Games Editorial Team. Developed a publishing pipeline for content and the infrastructure for serving that content to users at scale. Development of an editorial workflow for editing and testing puzzles. Developed an OCR PDF parser for automating part of the crossword submission process. Documented and improved the team's development environment using tools that helped us better match production locally. Lead migration of services from App Engine to Kubernetes. Member of the Game Design Working Group, Games DEI Steering Committee, and NYT Tech Mentorship Program.","Remote",[11,12,13,14,15,16,17,18,19,20,21,22,23,24,25],"Go","React","Typescript","PostgreSQL","MySQL","NextJS","Java","CICD","CSS","DDD","GCP","PubSub","Docker","Kubernetes","Terraform",{"company":27,"title":28,"currentPosition":5,"startDate":29,"endDate":7,"description":30,"location":9,"skills":31},"Coin Flip Games","Founder","2013-01-01","Digital-turned-analog game design. Created many digital games for multiple platforms using Unity3D and Löve2D. Pivoted to tabletop game design in 2016. Several designs have been published or are pending publication: Shuffle Grand Prix, Sonora, Mix Tape, and It's a Spork. Development of prototypes using Ruby\u002FSquib.",[32,33,34,35,36],"Ruby","Automation","CSharp","Git","Illustrator",{"company":38,"title":39,"currentPosition":40,"startDate":41,"endDate":42,"description":43,"location":9,"skills":44},"Research Square","Senior Software Engineer • R&D Team",false,"2015-05-01","2021-02-02","Developed a manuscript submission workflow for researchers on a Preprint platform. Designed and implemented a editorial workflow to pair with the submission workflow for splitting up work assignments. Automated collection and curation of manuscript data from many remote sources. Also rewrote payments and invoicing system for customers using many different payment methods based in non-US locations (China, Brazil, etc). ",[45,15,46,19,47,23,18,20,35,11,12,22],"PHP","Javascript","AWS",{"company":49,"title":50,"currentPosition":40,"startDate":51,"endDate":41,"description":52,"location":9,"skills":53},"Geographic Research","Software Engineer","2013-11-01","Backend development on spatial demography software including feature development and automating data pipelines. Some frontend development on internal tooling as a part of the data pipeline.",[45,14,46,19,18,47],{"company":55,"title":50,"currentPosition":40,"startDate":56,"endDate":51,"description":57,"location":58,"skills":59},"Total Benchmark Solution","2012-04-01","Development of tooling to collect and analyze hospital and patient encounter data in a secure and compliant way. Created visualization and reporting tools by collaborating with statisticians. ","Fort Collins, CO",[45,15,46,19],{"company":61,"title":62,"currentPosition":40,"startDate":63,"endDate":64,"description":65,"location":58,"skills":66},"Synova","Electrical\u002FHardware Engineer II","2012-01-01","2012-03-01","Configuration and testing of prototype workstation PCs.",[67,33],"Hardware",{"company":69,"title":70,"currentPosition":40,"startDate":71,"endDate":72,"description":73,"location":58,"skills":74},"Hewlett-Packard","Software Engineering Intern","2008-05-01","2011-10-01","Configuration and testing of prototype workstation PCs. Also implemented a semi-automated inventory system for tracking internal assets. Developed automation tools for running benchmark applications.",[45,46,19,67,75,33],"TCL",[77,82,88],{"company":78,"title":79,"currentPosition":5,"startDate":80,"endDate":7,"description":81,"location":9},"Marcy Lab School","Mentorship Program","2022-11-01","Bi-weekly meetings with a current student to help prepare them for their first job in Software Engineering.",{"company":83,"title":84,"currentPosition":7,"startDate":85,"endDate":86,"description":87,"location":9},"Tabletop Mentorship Program","Mentor","2019-05-01","2021-07-01","Work with aspiring tabletop game designers to help them solve design problems, make industry connections, and keep them accountable so they can make progress towards their goals.",{"company":78,"title":89,"currentPosition":7,"startDate":90,"endDate":7,"description":91,"location":9},"Mock Interview","2021-03-19","Perform a mock technical interview with a current student at the Marcy Lab to help prepare them for the real thing."],"uses":{}}]}